AmandioCordeiro/IMEC/STM32f405_Simulation_IFOC/src/stm32_sine_3_m4.cpp
/*
 * This file is part of the stm32-sine project.
 *
 * Copyright (C) 2010 Johannes Huebner <contact@johanneshuebner.com>
 * Copyright (C) 2010 Edward Cheeseman <cheesemanedward@gmail.com>
 * Copyright (C) 2009 Uwe Hermann <uwe@hermann-uwe.de>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
#include <stdint.h>
#include <libopencm3/stm32/usart.h>
#include <libopencm3/stm32/timer.h>
#include <libopencm3/stm32/rtc.h>

#include <libopencm3/cm3/systick.h>

#include <libopencm3/stm32/can.h>
#include <libopencm3/stm32/spi.h>
#include <libopencm3/stm32/iwdg.h>
#include "terminal.h"
#include "terminalcommands.h"
#include "sine_core.h"
#include "fu.h"
#include "foc.h"
#include "hwdefs.h"
#include "hwinit.h"
#include "params.h"
#include "param_save.h"
#include "digio.h"
#include "anain.h"
#include "inc_encoder_m4.h"
#include "throttle.h"
#include "my_math.h"
#include "stm32scheduler.h"
#include "stm32schedulerSecond.h"

#include "pwmgeneration.h"
//#include "temp_meas.h"
#include "vehiclecontrol.h"
#include "stm32_can.h"
#include "canmap.h"
#include "cansdo.h"
#include <libopencm3/cm3/systick.h>

#define PRINT_JSON 0

#include "VehicleSimulation.h"
#include "ifoc.hpp"//TODO
#include "variables.hpp"


HWREV hwRev; //Hardware variant of board we are running on

static Stm32Scheduler* scheduler;
static Stm32SchedulerSecond* scheduler2;
static CanHardware* can;
static CanMap* canMap;
static CanSdo* canSdo;
static Terminal* terminal;
static bool seenBrakePedal = false;

extern float torquePercent;
#ifdef IFOC_ALG
static IFOC IFOC_;//TODO
//IFOC IFOC_;//TODO_ create it in embedded
RotFluxAng	IFOC::angle;//(0.0);//TODO_ create it in embedded
battery_simulation IFOC::bat;//(0.0);
float IFOC::const_VDQ_d = 0.000001; 
float IFOC::const_VDQ_q = 0.000001;
//float Vmax=VDC/sqrt(3.0);	//need actualization in pratice in function get_VDC(

#endif

static void Ms100Task(void)
{
//printf("cem \n\r");
   DigIo::led_out.Toggle();
   iwdg_reset();
   float cpuLoad = PwmGeneration::GetCpuLoad() + scheduler->GetCpuLoad();
   Param::SetFloat(Param::cpuload, cpuLoad / 10);
   Param::SetInt(Param::turns, Encoder::GetFullTurns());
   Param::SetInt(Param::lasterr, ErrorMessage::GetLastError());
//full rotor turns since power up
       //TODO numero de rotaçoes, set, acima
   if (hwRev == HW_REV1 || hwRev == HW_BLUEPILL)
   {
      //If break pin is high and both mprot and emcystop are high than it must be over current
      if (DigIo::emcystop_in.Get() && DigIo::mprot_in.Get() && DigIo::bk_in.Get())
      {
         Param::SetInt(Param::din_ocur, 0);
      }
      else
      {
         Param::SetInt(Param::din_ocur, 1);
      }
      Param::SetInt(Param::din_desat, 2);
   }

   if (systick_get_value()/**rtc_get_counter_val());TODO AMRC**/ > 50) //500ms after start check for brake pedal
      seenBrakePedal |= (Param::GetInt(Param::cruisemode) == CRUISE_OFF) || Param::GetBool(Param::din_brake);

   VehicleControl::SelectDirection();
   VehicleControl::CruiseControl();

   #if CONTROL == CTRL_SINE
   //uac = udc * amp/maxamp / sqrt(2)
   
   #ifdef VehicleSimulation

    Param::SetFloat(Param::udc, VDC);
   #endif
   
   float uac = Param::GetFloat(Param::udc) * SineCore::GetAmp();
   uac /= SineCore::MAXAMP;
   uac /= 1.4142;
//TODO OPENINVERTER simulation. uac,
   Param::SetFloat(Param::uac, uac);
   #endif // CONTROL

   if (Param::GetInt(Param::canperiod) == CAN_PERIOD_100MS)
      canMap->SendAll();
}

static void RunCharger(float udc)
{
   static float chargeCurRamped = 0;

   float chargeCur = Param::GetFloat(Param::chargecur);
   float tempDerate = 100;
   float udcDerate = -100; //we use the regen udc limiter, therefor negative starting value

   Throttle::TemperatureDerate(Param::GetFloat(Param::tmphs), Param::GetFloat(Param::tmphsmax), tempDerate);
   Throttle::UdcLimitCommand(udcDerate, udc);
   udcDerate = MIN(-udcDerate, tempDerate); //and back to positive
   chargeCur = udcDerate * chargeCur / 100;

   if (chargeCur < chargeCurRamped)
      chargeCurRamped = chargeCur;
   else
      chargeCurRamped = RAMPUP(chargeCurRamped, chargeCur, 1);
   PwmGeneration::SetChargeCurrent(chargeCurRamped);
}

//Normal run takes 70µs -> 0.7% cpu load (last measured version 3.5)
static void Ms10Task(void)
{
					//printf(" w_ref %f n*T %f dist %f wr:%f \r\n", FP_FROMFLT(w_ref), FP_FROMFLT((float(n)*T)), FP_FROMFLT(distance_), FP_FROMFLT(wr));
//printf("dez\n\r");
  //fprintf(terminal,"dez");
  
   static int initWait = 0;
   int opmode = Param::GetInt(Param::opmode);
   int chargemode = Param::GetInt(Param::chargemode);
   int newMode = MOD_OFF;
   int stt = STAT_NONE;
   float udc = VehicleControl::ProcessUdc();

#ifdef VehicleSimulation

    udc = VDC;
//Param::SetFloat(Param::udc, VDC);

//TODO AMRC set udc
#endif

   ErrorMessage::SetTime( systick_get_value()/*rtc_get_counter_val()*/);//TODO AMRC
   Encoder::UpdateRotorFrequency(100);
   VehicleControl::CalcAndOutputTemp();
   VehicleControl::GetDigInputs();
   float torquePercent = VehicleControl::ProcessThrottle();
   
   #ifdef VehicleSimulation

   //TODO AMRC set torquePercent
   torquePercent = w_ref / MAX_RAD_S * 100;
   #endif
   
   Param::SetInt(Param::speed, Encoder::GetSpeed());
   
   //TODO AMRC set Speed
   
   Param::SetInt(Param::rotordir, Encoder::GetRotorDirection());

   if (MOD_RUN == opmode && initWait == -1)
   {
      PwmGeneration::SetTorquePercent(torquePercent);
   }
   else if ((MOD_BOOST == opmode || MOD_BUCK == opmode) && initWait == -1)
   {
      RunCharger(udc);
   }

   stt |= DigIo::emcystop_in.Get() || hwRev == HW_REV3 ? STAT_NONE : STAT_EMCYSTOP;
   stt |= DigIo::mprot_in.Get() ? STAT_NONE : STAT_MPROT;
   stt |= Throttle::IsThrottlePressed(Param::GetInt(Param::pot)) ? STAT_POTPRESSED : STAT_NONE;
   stt |= udc >= Param::GetFloat(Param::udcsw) ? STAT_NONE : STAT_UDCBELOWUDCSW;
   stt |= udc < Param::GetFloat(Param::udclim) ? STAT_NONE : STAT_UDCLIM;
   stt |= seenBrakePedal ? STAT_NONE : STAT_BRAKECHECK;

