AmandioCordeiro/IMEC/STM32f405_Simulation_IFOC/src/stm32_sine_3_m4.cpp
   /* switch on DC switch if
    * - throttle is not pressed
    * - start pin is high
    * - motor protection switch and emcystop is high (=inactive)
    * - udc >= udcsw
    * - udc < udclim
    */
   if ((stt & (STAT_EMCYSTOP | STAT_MPROT | STAT_POTPRESSED | STAT_UDCBELOWUDCSW | STAT_UDCLIM | STAT_BRAKECHECK)) == STAT_NONE)
   {
      /* Switch to charge mode if
       * - Charge mode is enabled
       * - Fwd AND Rev are high
       */
      if (Param::GetBool(Param::din_forward) &&
          Param::GetBool(Param::din_reverse) &&
         !Param::GetBool(Param::din_bms) &&
          chargemode >= MOD_BOOST)
      {
         //In buck mode we precharge to a different voltage
         if ((chargemode == MOD_BUCK && udc >= Param::GetFloat(Param::udcswbuck)) || chargemode == MOD_BOOST)
         {
            newMode = chargemode;

            //Prius needs to run PWM before closing the contactor
            if (hwRev == HW_PRIUS && opmode != MOD_BOOST && opmode != MOD_BUCK)
            {
               PwmGeneration::SetChargeCurrent(0);
               PwmGeneration::SetOpmode(newMode);
            }
         }
      }
      else if (Param::GetBool(Param::din_start) || Param::GetBool(Param::manualstart) ||
              (Param::GetInt(Param::tripmode) == TRIP_AUTORESUME && PwmGeneration::Tripped()))
      {
         newMode = MOD_RUN;
         Param::SetInt(Param::manualstart, 0);
      }
      stt |= opmode != MOD_OFF ? STAT_NONE : STAT_WAITSTART;
   }

   Param::SetInt(Param::status, stt);

   if (newMode != MOD_OFF)
   {
      opmode = newMode;
      DigIo::dcsw_out.Set();
      DigIo::err_out.Clear();
      Param::SetInt(Param::opmode, newMode);
      ErrorMessage::UnpostAll();
   }

   if (hwRev != HW_TESLA && opmode >= MOD_BOOST && Param::GetBool(Param::din_bms))
   {
      opmode = MOD_OFF;
      Param::SetInt(Param::opmode, opmode);
   }

   if (MOD_OFF == opmode)
   {
      initWait = 50;

      VehicleControl::SetContactorsOffState();
      PwmGeneration::SetOpmode(MOD_OFF);
      Throttle::cruiseSpeed = -1;
      TerminalCommands::EnableSaving();
      canSdo->EnableSaving();
   }
   else if (0 == initWait)
   {
      //Disable saving in Run mode
      TerminalCommands::DisableSaving();
      canSdo->DisableSaving();
      PwmGeneration::SetTorquePercent(0);
      Throttle::RampThrottle(0); //Restart ramp
      Encoder::Reset();
      //this applies new deadtime and pwmfrq and enables the outputs for the given mode
      PwmGeneration::SetOpmode(opmode);
      DigIo::err_out.Clear();
      DigIo::prec_out.Clear();
      initWait = -1;
   }
   else if (initWait == 10)
   {
      PwmGeneration::SetCurrentOffset(AnaIn::il1.Get(), AnaIn::il2.Get());
      
      //TODO AMRC set il1 il2
      #ifdef VehicleSimulation

     /* int il11 = get_ias(); int il22 = get_ibs();*/
      PwmGeneration::SetCurrentOffset( ( get_ias() ) , ( get_ibs() ) /*il11, il22*/);
      #endif
      
      initWait--;
   }
   else if (initWait > 0)
   {
      initWait--;
   }

   Param::SetInt(Param::uptime, systick_get_value()/**rtc_get_counter_val());TODO AMRC**/);

   if (Param::GetInt(Param::canperiod) == CAN_PERIOD_10MS)
      canMap->SendAll();
}


#ifdef VehicleSimulationFull
extern float T_G_R;
static float IDC_med_ = 0.0;
extern float IDC_med;
#endif

//#endif 
extern float IDQ_d_lma;//TODO REMOVE AT END
static void VehicleSimulationTask(void){
             static int nprint = 0 ;
//static int ni = 0 ;
               if ( nprint > ( 1 / T ) ) 
               {//every 1 second
					printf(" w_ref %f n*T %f dist %f wr:%f  \r\n", FP_FROMFLT(w_ref), FP_FROMFLT((float(ni)*T)), FP_FROMFLT(distance_), FP_FROMFLT(wr));
//				fprintf(terminal,"IDQ.d %f IDQ_d_lma %f 1/T %f w_ref %f n*T %f dist %f wr:%f  \r\n",FP_FROMFLT( IDQ.d ) ,FP_FROMFLT( IDQ_d_lma ) , FP_FROMFLT((1 / T)), FP_FROMFLT(w_ref), FP_FROMFLT(((ni)*T)), FP_FROMFLT(distance_), FP_FROMFLT(wr));
					nprint = 0;
					//printf(" 1 sec\r\n");
					// TODO remove at end
					//printf("  %f n*T %f dist %f rcc_apb2_frequency/1000000.0 : %f n %f \n", FP_FROMFLT(w_ref), FP_FROMFLT((float(n)*T)), FP_FROMFLT(distance_), FP_FROMFLT( (float(rcc_apb2_frequency)/1000000.0)/**rcc_get_timer_clk_freq(TIM2)**/),FP_FROMFLT(float(n)));
			   }
			   else
				{
			   nprint++;
			    }
			    
			    
    // (RoadGradienteF && get_w_r()!=0) {
            //uint16_t a=SineCore::Atan2();//TODO
           // float a=atan(gradiente);

			//float load_C_R;
			//if (velocidade>0)
            //    load_C_R=C_R*MASSA*G*SineCore::Cosine((a<<15)/PI);
			//else
             //   if(velocidade<0)load_C_R = -C_R*MASSA*G*SineCore::Cosine((a<<15)/PI);
              //  else if (velocidade==0)load_C_R=0;
            //load=(C_D*1/2*RO_AIR*A_F*/*wr*/velocidade/T_G_R*R*/*wr*/velocidade/T_G_R*R + load_C_R + MASSA*G*SineCore::Sine((a<<15)/PI))*R/T_G_R;//torque resistant vehicle
   //  }
    //else load=load_s;//load_s set

#ifdef VehicleSimulationFull
/*VehicleSimulation::*/if (DrivingCycleTask())
					set_w_ref(w_ref);//in simulation of driving cycle not needed, in real throttle...
#endif

#ifdef IFOC_ALG
#ifndef VehicleSimulation
/*float torquePercent = VehicleControl::ProcessThrottle()*/;
set_w_ref(/*torquePercent*/( VehicleControl::ProcessThrottle() ) / 100 * MAX_RAD_S );
#endif
#endif

#ifdef IFOC_ALG_TORQUE
torquePercent = VehicleControl::ProcessThrottle();

#endif // IFOC_ALG_Torque
			//???TODO needed or just get_wr(
//			set_torq_L(load);//TODO this is only in simulation, not needed in real


			//set_Theta_r();
			////IFOC_.get_VDC();//TODO_ adapt in real(embedded).function must read DC voltage
			//TODO in real the following reads from e Hall sensors
			//TODO julgo n ser necessario seguinte, trat em GetDutyCycles
			//get_ias();/*cout<<"ia"<<abc_current.a<<endl;*/get_ibs();get_ics();//abc_current.c=-abc_current.a-abc_current.b;//TODO: for real motor, is better get abc_current.c from measure

			//**float ia=get_ias();//TODO to measure cos phi
			//**função a seguir com tempo variavel, necessario resolver para tempo const
			//**svpwm(control);//news gates and times
			/*here*/
			#ifdef VehicleSimulationFull
			iaa_p=get_ias();//used to calc cosphi
			vaa_p=vaa;//used to calc cosphi
			#endif


/////____

