AmandioCordeiro/IMEC/STM32f405_Simulation_IFOC/src/stm32_sine_3_m4.cpp
			#ifdef VehicleSimulation
			VDC = 215 ;//IFOC::bat.get_VDC();//TODO remove and implement in real, :next line
			//in real, s32fp VDC = ProcessUdc();
            #endif
#ifdef IFOC_ALG
#ifndef VehicleSimulation

/*float udc */VDC = VehicleControl::ProcessUdc();

//VDC = udc ;
#endif
#endif

			Vmax = VDC/CONST_SQRT3_;
			//**get_wr(vaa,vbb,vcc);

			// the following "if" is for run simulation of motor in half of T
			//L//if (n%2 == 0 /*&& n != 0*/){
			//L//	T=T*2.0;
	#ifdef VehicleSimulation


              //in real ?? wr = Encoder::GetSpeed(); // pass to rad /sec  */
				/*in real w_ref= *//*s32fp torquePercent = *//*ProcessThrottle()*MAXRADSEC;*//*(criar este define)*//*commanded rotor speed*/
				IFOC_.GetDutyCycles(/*in real s32fp il1 = GetCurrent(AnaIn::il1, ilofs[0]??, Param::Get(Param::il1gain));*/ ( get_ias() ),/*in real s32fp il2 = GetCurrent(AnaIn::il2, ilofs[1]??, Param::Get(Param::il2gain));*/ ( get_ibs() ), /*get_*/VDC/*()*/ , /*vaa, vbb, vcc,,*/ w_ref , wr ) ;
	#endif
			#ifdef IFOC_ALG
			#ifndef VehicleSimulation
			//TODO il1 or other name
			float il1 = Param::GetFloat(Param::il1) ;
			float il2 = Param::GetFloat(Param::il2) ;
			IFOC_.GetDutyCycles(/*in real s32fp il1 =*//*FLT_FROMFP(GetCurrent(AnaIn::il1, ilofs[0], Param::Get(Param::il1gain)))*//*(get_ias())*/il1,/*in real *//*s32fp il2 = *//*FLT_FROMFP(GetCurrent(AnaIn::il2, ilofs[1], Param::Get(Param::il2gain)))*//* (get_ibs())*/ il2 , /*get_VDC()*/ VDC /*TODO udc?? or VDC*/,/*vaa, vbb, vcc,,*/ /*w_ref*/ torquePercent * 1000 / 100 , /*wr*/ Encoder::GetRotorFrequency() * 2 * PI ) ;
			#endif
			#endif
			//L//	T=T/2.0;

//_T1T2 << " vaa_n:" << vaa <<" vbb_n:"<<vbb<<" vcc_n:"<<vcc<<endl<<"IDC_previous: "<<IDC<<endl;
//L//fTorque<<" vaa_n:"<<vaa<<" vbb_n:"<<vbb<<" vcc_n:"<<vcc<<endl<<"IDC_previous: "<<IDC<<" VDC: "<<VDC<<" "<<endl;

#ifdef VehicleSimulationFull
			get_wr(vaa,vbb,vcc);

	{		//********** used in simulation to calc cos_phi
				//L//if (n%2 == 0 /*&& n != 0*/){
					//L//fTorque<<"power iaa*vaa+ibb*vbb+icc*vcc: "<<get_ias()*vaa+/*InvClarkePark(RotorFluxAngle,IDQ)*/get_ibs()*vbb+get_ics()*vcc<<endl;
					//fTorque<<"vaa: "<<vaa<<" iaa: "<<abc_current.a<<endl;
				//L//	sfData_va_ia<<" "<<FIXED_FLOAT(n*T)<<" "<<vaa<<" "<<get_ias()<<" "<<get_ibs()<<" "<<get_ics()<<endl;
				//L//	fTorque<<" ia "<<get_ias()<<" ib "<<get_ibs()<<" ic "<<get_ics()<<endl;

				//L//}
					if ( vaa_p >0 && vaa_p*vaa < 0 ) {
						cos_phi = ni * T;
					//L//	fTorque<<"vaa pass by zero"<<endl;
					}
					else {
                            //L//fTorque<<"vaa_p:"<<vaa_p<<"vaa:"<<vaa<<endl;
                            }
					if ( iaa_p >0 && iaa_p*get_ias() < 0 ) {
						two_phi= ni *T-desc_p;
						desc_p= ni *T;
						cos_phi= ni *T-cos_phi;
						cos_phi_a=cos_phi/two_phi*2*PI;
						//L//fTorque/*<<"cos_phi_t "<<cos_phi*/<<" phi: "<<cos_phi_a<<" cos_phi: "<<cos(cos_phi_a)<<endl;
						}
					else {
						//L//fTorque<<"iaa_p"<<iaa_p<<"iaa"<<get_ias()<<" phi: "<<cos_phi_a<<" cos_phi: "<<cos(cos_phi_a)<<endl;
						}

			//**********
	}

			//fTorque<<" ia "<<get_ias()<<" ib "<<get_ibs()<<" ic "<<get_ics()<<endl;
			distance_ += velocidade / T_G_R * R * T ; 
			//L//fVel<<FIXED_FLOAT(n*T)<<"sec.;"<< " velocity clutch (rad/s): "<<velocidade<<"; T_G_R(total gear ratio): "<<T_G_R;
			 //L//fVel<<";vehicle speed (km/h): "<< velocidade * R / T_G_R * 3.6 << ";  distance: "<<distance_<<" meters"<<endl;
              Param::SetFloat(Param::car_speed, ( velocidade * R / T_G_R * 3.6 ) ) ;
              Param::SetFloat(Param::dr_cycle_sp, ( w_ref / 1000 * 3600 / T_G_R * R ) ) ;

#endif
//_____________

//_____________
		//:::::::IDC medio
#ifdef VehicleSimulationFull

		if (it_<30000){
			it_++ ;
			IDC_med += IDC ;
		//	IDC_med_ = (IDC_med/it);
			//IDC_med/=2;

		}else{
			it_ = 0 ;
			IDC_med = 0.0 ;
			IDC_med_ = ( IDC_med / it_ ) ;
			}
	//L//	if (n%2 ==0 )
	//L//		fTorque<<" IDC med "<<IDC_med_<<endl;
		//::::::::
#endif

#ifdef VehicleSimulation //TODO ni < xpto
		ni++;
#endif
	//L//	fTorque<<endl;
}

//TODO
/** This function is called when the user changes a parameter */
//void Param::Change(Param::PARAM_NUM paramNum)
//....



/** This function is called when the user changes a parameter */
void Param::Change(Param::PARAM_NUM paramNum)
{
   switch (paramNum)
   {
   #if CONTROL == CTRL_SINE
      case Param::fslipspnt:
         PwmGeneration::SetFslip(Param::Get(Param::fslipspnt));
         break;
      case Param::ampnom:
         PwmGeneration::SetAmpnom(Param::Get(Param::ampnom));
         break;
   #endif
      case Param::canspeed:
         can->SetBaudrate((CanHardware::baudrates)Param::GetInt(Param::canspeed));
         break;
      case Param::throtmax:
      case Param::throtmin:
      case Param::idcmin:
      case Param::idcmax:
      case Param::offthrotregen:
         //These are candidates to be frequently set by CAN, so we handle them separately
         Throttle::throtmax = Param::GetFloat(Param::throtmax);
         Throttle::throtmin = Param::GetFloat(Param::throtmin);
         Throttle::idcmin = Param::GetFloat(Param::idcmin);
         Throttle::idcmax = Param::GetFloat(Param::idcmax);
         #ifdef VehicleSimulation
         Throttle::idcmin = IDCmin ;
         Throttle::idcmax = IDCmax ;
         #endif // VehicleSimulation
         Throttle::brkmax = Param::GetFloat(Param::offthrotregen);
         break;
      case Param::nodeid:
         canSdo->SetNodeId(Param::GetInt(Param::nodeid));
         //terminal->SetNodeId(Param::GetInt(Param::nodeid));
         break;
      default:
         PwmGeneration::SetCurrentLimitThreshold(Param::Get(Param::ocurlim));
         PwmGeneration::SetPolePairRatio(Param::GetInt(Param::polepairs) / Param::GetInt(Param::respolepairs));

         #if CONTROL == CTRL_FOC
         PwmGeneration::SetControllerGains(Param::GetInt(Param::iqkp), Param::GetInt(Param::idkp), Param::GetInt(Param::curki));
         Encoder::SwapSinCos((Param::GetInt(Param::pinswap) & SWAP_RESOLVER) > 0);
         FOC::SetMotorParameters(Param::GetFloat(Param::lqminusld) / 1000.0f, Param::GetFloat(Param::fluxlinkage) / 1000.0f);
         FOC::SetMaximumModulationIndex(Param::GetInt(Param::modmax));
         #endif // CONTROL

         Encoder::SetMode((enum Encoder::mode)Param::GetInt(Param::encmode));
         Encoder::SetImpulsesPerTurn(Param::GetInt(Param::numimp));
         Encoder::SetSinCosOffset(Param::GetInt(Param::sincosofs));

         Throttle::potmin[0] = Param::GetInt(Param::potmin);
         Throttle::potmax[0] = Param::GetInt(Param::potmax);
         Throttle::potmin[1] = Param::GetInt(Param::pot2min);
         Throttle::potmax[1] = Param::GetInt(Param::pot2max);
         Throttle::brknom = Param::GetFloat(Param::regentravel);
         Throttle::brknompedal = Param::GetFloat(Param::brakeregen);
         Throttle::regenRamp = Param::GetFloat(Param::regenramp);
         Throttle::maxregentravelhz = Param::GetFloat(Param::maxregentravelhz);
         Throttle::brkmax = Param::GetFloat(Param::offthrotregen);
         Throttle::brkcruise = Param::GetFloat(Param::cruiseregen);
         Throttle::throtmax = Param::GetFloat(Param::throtmax);
         Throttle::throtmin = Param::GetFloat(Param::throtmin);
         Throttle::idleSpeed = Param::GetInt(Param::idlespeed);
         Throttle::holdkp = Param::GetFloat(Param::holdkp);
         Throttle::speedkp = Param::GetFloat(Param::speedkp);
         Throttle::speedflt = Param::GetInt(Param::speedflt);
         Throttle::idleThrotLim = Param::GetFloat(Param::idlethrotlim);
         Throttle::cruiseThrotLim = Param::GetFloat(Param::cruisethrotlim);
         Throttle::bmslimlow = Param::GetInt(Param::bmslimlow);
         Throttle::bmslimhigh = Param::GetInt(Param::bmslimhigh);
         Throttle::udcmin = Param::GetFloat(Param::udcmin) * 0.99f; //Leave some room for the notification light
         Throttle::udcmax = Param::GetFloat(Param::udcmax) * 1.01f;
         Throttle::idcmin = Param::GetFloat(Param::idcmin);
         Throttle::idcmax = Param::GetFloat(Param::idcmax);
         Throttle::idckp = Param::GetFloat(Param::idckp);
         Throttle::accelflt = Param::GetInt(Param::accelflt);
         Throttle::accelmax = Param::GetInt(Param::accelmax);

