AmandioCordeiro/IMEC/STM32f405_Simulation_IFOC/src/stm32_sine_3_m4.cpp
         if (hwRev != HW_BLUEPILL)
         {
            if (Param::GetInt(Param::pwmfunc) == PWM_FUNC_SPEEDFRQ)
			{   //TODO : ask 
				              //- gpio_set_mode(GPIOB, GPIO_MODE_OUTPUT_50_MHZ, GPIO_CNF_OUTPUT_PUSHPULL, GPIO9);
			gpio_mode_setup(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO9);
			}
            else
            {
 //TODO : ask 
               //gpio_set_mode(GPIOB, GPIO_MODE_OUTPUT_50_MHZ, GPIO_CNF_OUTPUT_ALTFN_PUSHPULL, GPIO9);
              //??
               gpio_mode_setup(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO9);
			    gpio_set_af(GPIOB, GPIO_AF2, GPIO9);//??AF2?? TIM4_CH4       
			 } 
			}
         break;
   }
}


static void UpgradeParameters()
{
   Param::SetInt(Param::version, 4); //backward compatibility
   Param::SetInt(Param::hwver, hwRev);
   Param::SetInt(Param::regenpreset, 100); //default to 100% regen if not CAN mapped

   if (Param::GetInt(Param::snsm) < 12)
      Param::SetInt(Param::snsm, Param::GetInt(Param::snsm) + 10); //upgrade parameter
   if (Param::Get(Param::offthrotregen) > 0)
      Param::Set(Param::offthrotregen, -Param::Get(Param::offthrotregen));

   s32fp maxPotMax = Param::GetAttrib(Param::potmax)->max;
   s32fp potMax = Param::Get(Param::potmax);

   if (potMax > maxPotMax)
      Param::SetFixed(Param::potmax, maxPotMax);

   //Remove CAN mapping for safety critical values
   canMap->Remove(Param::pot);
   canMap->Remove(Param::pot2);
   canMap->Remove(Param::canio);
   canMap->Remove(Param::cruisespeed);
   canMap->Remove(Param::regenpreset);
}

extern "C" void tim2_isr(void)
{
   scheduler->Run();
}

//extern "C" void tim4_isr(void)
//{
//  scheduler->Run();
//}

extern "C" void tim5_isr(void)
{	
   scheduler2->Run();
}
//C++ run time requires that when using interfaces and not optimizing for size
extern "C" void __cxa_pure_virtual() { while (1); }

extern "C" int main(void)
{
   extern const TERM_CMD TermCmds[];

   clock_setup();
   rtc_setup();
   hwRev = io_setup();
   tim_setup();
   nvic_setup();
   parm_load();
   ErrorMessage::SetTime(1);
   Param::SetInt(Param::pwmio, pwmio_setup(Param::GetBool(Param::pwmpol)));

   MotorVoltage::SetMaxAmp(SineCore::MAXAMP);
   PwmGeneration::SetCurrentOffset(2048, 2048);

   Stm32Scheduler s(hwRev == HW_BLUEPILL ? TIM4 : TIM2); //We never exit main so it's ok to put it on stack
   scheduler = &s;
   Stm32SchedulerSecond secondTimer( TIM5 );
   scheduler2 = &secondTimer;

   Stm32Can c(CAN1, (CanHardware::baudrates)Param::GetInt(Param::canspeed));
   CanMap cm(&c);
   CanSdo sdo(&c, &cm);
   can = &c;
   canMap = &cm;
   canSdo = &sdo;
   VehicleControl::SetCan(can);
   TerminalCommands::SetCanMap(canMap);

   s.AddTask(Ms100Task, 100);//100
   s.AddTask(Ms10Task, 10);//10
 
#ifdef IFOC_ALG
  
    secondTimer.AddTask(VehicleSimulationTask, uint16_t((0/**rcc_apb1_frequency * T**/ /**2khz -> *4 **/ )  ) );//TODO 10500 indiferent 1 ou 0 . 12.5 1  0.000125s , 8 khz

//s.AddTask(VehicleSimulationTask, 12.5);//0.000125s , 8 khz
//s.AddTask(MotorSimulHalfPeriodTask, 12.8/2);
#endif
 
   DigIo::prec_out.Set();

   Terminal t(USART3, TermCmds);
   terminal = &t;

   if (hwRev == HW_REV1)
      t.DisableTxDMA();

   UpgradeParameters();
   Param::Change(Param::PARAM_LAST);
   Param::Change(Param::nodeid);
   write_bootloader_pininit(Param::GetBool(Param::bootprec), Param::GetBool(Param::pwmpol));

   while(1)
   {
      char c = 0;
      t.Run();
      if (canSdo->GetPrintRequest() == PRINT_JSON)
      {
         TerminalCommands::PrintParamsJson(canSdo, &c);
      }
   }

   return 0;
}


